blog-posts/2007-12-16-gnus-multi-pane-tricks-or-i-heart-planet-emacsen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Gnus multi-pane tricks, or I heart Planet Emacsen</title>
<!-- 2014-04-30 Wed 17:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Gnus multi-pane tricks, or I heart Planet Emacsen</h1>
<p>
December 16th, 2007 -
<a href="http://sachachua.com/blog/p/4525"><a href="http://sachachua.com/blog/p/4525">http://sachachua.com/blog/p/4525</a></a>
</p>

<p>
The tips Joseph Miklojcik shared for
<a href="http://jfm3-repl.blogspot.com/2007/12/emacs-tricks-7-use-gnus-for-email.html">reading
e-mail in Gnus</a> included this \<sub>really\</sub>_ nifty thing that I hadn't come
across when I set up my Gnus before: <b>multi-pane reading</b>.
</p>

<p>
You know how modern news readers have a folder pane, a summary pane
 and a preview pane?
</p>

<p>
Well, you can have that too.
</p>

<pre class="example">
(gnus-add-configuration
 '(article
   (horizontal 1.0
        (vertical 60 (group 1.0))
        (vertical 1.0
    (summary 0.20 point)
    (article 1.0)))))

(gnus-add-configuration
 '(summary
   (horizontal 1.0
        (vertical 60 (group 1.0))
        (vertical 1.0 (summary 1.0 point)))))
</pre>

<p>
This is good stuff. =)
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/gnus">gnus</a>
</p>

<p>
Random Emacs symbol: sacha/gnus-add-subject-to-bbdb-record &#x2013; Function:
Add datestamped subject note for each person this message has been sent
to.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
